# Начальные параметры по вариантам
x_start = 0  # км, начало отрезка
x_end = 106.6  # км, конец отрезка
D = 630  # мм, внешний диаметр
delta = 8  # мм, толщина стенки
roughness = 0.18  # мм, абсолютная шероховатость
rho_20 = 842.4  # кг/м3, плотность при 20 оС
nu_20 = 25  # сСт, вязкость при 20 оС
nu_50 = 4.4  # сСт, вязкость при 50 оС
p_start = 5.48  # МПА, начальное давление
p_end = 0.92  # МПа, конечное давление
T = 5.8  # оС, температура

# Начальные параметры, задающиеся пользователем
c = 1532.3  # м/с, скорость звука

# Перевод в систему СИ
